//------------------------------------------------------------------------------
//
//  Copyright (C) 2004-2008, Freescale Semiconductor, Inc. All Rights Reserved.
//  THIS SOURCE CODE, AND ITS USE AND DISTRIBUTION, IS SUBJECT TO THE TERMS
//  AND CONDITIONS OF THE APPLICABLE LICENSE AGREEMENT
//
//------------------------------------------------------------------------------
//
//  Header:  mx51_usb.h
//
//  Provides definitions for usb module based on Freescale MX51 SoC.
//
//------------------------------------------------------------------------------
#ifndef __MX51_USB_H
#define __MX51_USB_H

#include <common_usb.h>


#if __cplusplus
extern "C" {
#endif

typedef struct {
    //****************OTG Registers ********************************************
                                //      off DEV OTG SPH MPH 
    UINT32 ID;                  // RO   0   *   *   *   *   Identification Register
    UINT32 HWGENERAL;           // RO   4   *   *   *   *   General Hardware Parameters
    UINT32 HWHOST;              // RO   8       *   *   *   Host Hardware Parameters
    UINT32 HWDEVICE;            // RO   C   *   *           Device Hardware Parameters
    UINT32 HWTXBUF;             // RO   0x10    *   *   *   *   TX Buffer Hardware Parameters
    UINT32 HWRXBUF;             // RO   0x14    *   *   *   *   RX Buffer Hardware Parameters 
    //UINT32 HWTTTXBUF;           //      0x18                *   TT-TX Buffer Hardware Parameters
    //UINT32 HWTTRXBUF;           //      0x1C                *   TT-RX Buffer Hardware Parameters
    UINT32 RESERVED1[26];       //      0x18-0x7c
    UINT32 GPTIMER0LD;          //   0x80
    UINT32 GPTIMER0CTRL;        //  0x84
    UINT32 GPTIMER1LD;          //   0x88
    UINT32 GPTIMER1CTRL;        //  0x8c
    UINT32 RESERVED2[28];       // 0x90-0xfc
    UINT8  CAPLENGTH;           // RO   0x100*  *   *   *   Capability Register Length
    UINT8  RESERVED3;           //      0x101
    UINT16 HCIVERSION;          // RO   0x102   *   *   *   Host Interface Version Number
    UINT32 HCSPARAMS;           // RO   0x104   *   *   *   Host Control Structural Parameters
    UINT32 HCCPARAMS;           // RO   0x108   *   *   *   Host Control Capability Parameters
    UINT32 RESERVED4[5];        //      0x10C-0x11f
    UINT16 DCIVERSION;          // RO   0x120*  *           Device Interface Version Number
    UINT16 RESERVED5;           //      0x122
    UINT32 DCCPARAMS;           // RO   0x124*  *           Device Control CapabilityParameters
    UINT32 RESERVED6[6];        //      0x128-0x13C
    UINT32 USBCMD;              //      0x140*  *   *   *   USB Command
    UINT32 USBSTS;              //      0x144*  *   *   *   USB Status
    UINT32 USBINTR;             //      0x148*  *   *   *   USB Interrupt Enable
    UINT32 FRINDEX;             //      0x14C*  *   *   *   USB Frame Index; Read/Write in host mode, Read in device mode
    UINT32 CTRLDSSENGMENT;      // RO   0x150               This register is not used in this implementation.
    union {
        UINT32 PERIODICLISTBASE;//      0x154   *   *   *   Frame List Base Address
        UINT32 USBADR;          //          *   *           USB Device Address
    }T_154H;                    // Read/Write (Writes must be DWord Writes)
    union {
        UINT32 ASYNCLISTADDR;   //      0x158   *   *   *   Next Asynchronous List Address
        UINT32 ENDPOINTLISTADDR;//          *   *           Address at Endpoint list in memory
    }T_158H;                    // Read/Write (Writes must be DWord Writes)
    UINT32 ASYNCTTSTS;          // 0x15C            *   Asynchronous Buffer Status For Embedded TT.
    UINT32 BURSTSIZE;           //      0x160*  *   *   *   Programmable Burst Size.
    UINT32 TXFILLTUNING;        //      0x164   *   *   *   Host Transmit Pre-Buffer Packet Tuning
    UINT32 TXTTFILLTUNING;      // 0x168                *   Host TT Transmit Pre-Buffer Packet Tuning
    UINT32 RESERVED7;           //      0x16C
    UINT32 ULPI_VIEWPORT;       //      0x170
    UINT32 RESERVED8;        //      0x174-0x178

    //The NAK interrupt is enabled to workaround the issue where the Device controller does not ACK 
    //the repeated status stages but NAKs them. ENDPTNAK and ENDPTNAKEN are the registers that are used to implement the workaround.
    UINT32 ENDPTNAK;            //  0x178
    UINT32 ENDPTNAKEN;          // 0x17c
    UINT32 CONFIGFLAG;          // RO   0x180   *   *   *   Configured Flag Register, This register is not used in this implementation. A read from this register returns a constant of a 00000001h to indicate that all port routings default to this host controller.
    UINT32 PORTSC[8];           //      0x184-0x1A0
                                //          *   *   *   *   Port Status/Control X
    UINT32 OTGSC;               //      0x1A4   *           On-The-Go(OTG) Status and Control
    UINT32 USBMODE;             //      0x1A8*  *   *   *   USB Device Mode
    UINT32 ENDPTSETUPSTAT;      //      0x1AC*  *           Endpoint Setup Status
    UINT32 ENDPTPRIME;          //      0x1B0*  *           Endpoint Initialization
    UINT32 ENDPTFLUSH;          //      0x1B4*  *           Endpoint De-Initialize
    UINT32 ENDPTSTATUS;         //      0x1B8*  *           Endpoint Status
    UINT32 ENDPTCOMPLETE;       //      0x1BC*  *           Endpoint Complete
    UINT32 ENDPTCTRL0;          //      0x1C0*  *           Endpoint Control 0
    UINT32 ENDPTCTRL    [15];   //      0x1C4-0x1FC
                                //          *   *           Endpoint Control 1-15

} CSP_USB_REG, * PCSP_USB_REG;

typedef volatile struct {
    CSP_USB_REG OTG;                    //  0
    CSP_USB_REG H1;                     //  0x200
    CSP_USB_REG H2;                     //  0x400
    CSP_USB_REG H3;                     //  0x600
    UINT32      USB_CTRL;              //  0x800
    UINT32      USB_OTG_MIRROR;       //  0x804
    UINT32      USB_PHY_CTRL_0;       // 0x808
    UINT32      USB_PHY_CTRL_1;       // 0x80c
    UINT32      USB_CTRL_1;           // 0x810
    UINT32      USB_UH2_CTRL;         // 0x814
    UINT32      USB_UH3_CTRL;         // 0x818
} CSP_USB_REGS, * PCSP_USB_REGS;

typedef struct _USB_CTRL {
    unsigned int BPE:1;     // Bypass Enable
                            // This bit enables/disables the USB Bypass function.
                            // 1 = Bypass active -- USB signals from Host port 1 are routed to the OTG port.
                            // 0 = Bypass inactive -- Normal mode operation.(default)
    unsigned int OTCKOEN:1;  //OTG ULPI PHY clock output enable
                            // 1 = CLK output disable
                            // 0 = CLK output enable
    unsigned int RESERVED:2; //Reserved. These bits are reserved and should be set to zero.
    unsigned int H1DISFSTLL:1; // host 1 serial TLL disable
                            // 1 = serial TLL is disable
                            // 0 = serial TLL is enable (default)
    unsigned int H1ICEN:1; // host 1 IC USB enable
                            // 1 = IC USB enable
