//------------------------------------------------------------------------------
//
//  Copyright (C) 2007-2009, Freescale Semiconductor, Inc. All Rights Reserved.
//  THIS SOURCE CODE, AND ITS USE AND DISTRIBUTION, IS SUBJECT TO THE TERMS
//  AND CONDITIONS OF THE APPLICABLE LICENSE AGREEMENT
//
//------------------------------------------------------------------------------
//
//  Header:  mx51_ccm.h
//
//  Provides definitions for the CCM (Clock Controller Module).
//
//------------------------------------------------------------------------------

#ifndef __MX51_CCM_H
#define __MX51_CCM_H

#ifdef __cplusplus
extern "C" {
#endif

//------------------------------------------------------------------------------
// GENERAL MODULE CONSTANTS
//------------------------------------------------------------------------------
#define CCM_CGR_CG_MASK                 (0x3)
#define CCM_NUM_CCGR                    7

//------------------------------------------------------------------------------
// REGISTER LAYOUT
//------------------------------------------------------------------------------
typedef struct
{
    UINT32 CCR;         // 0x0000
    UINT32 CCDR;        // 0x0004
    UINT32 CSR;         // 0x0008
    UINT32 CCSR;        // 0x000C
    UINT32 CACRR;       // 0x0010
    UINT32 CBCDR;       // 0x0014
    UINT32 CBCMR;       // 0x0018
    UINT32 CSCMR1;      // 0x001C
    UINT32 CSCMR2;      // 0x0020
    UINT32 CSCDR1;      // 0x0024
    UINT32 CS1CDR;      // 0x0028
    UINT32 CS2CDR;      // 0x002C
    UINT32 CDCDR;       // 0x0030
    UINT32 CHSCCDR;     // 0x0034
    UINT32 CSCDR2;      // 0x0038
    UINT32 CSCDR3;      // 0x003C
    UINT32 CSCDR4;      // 0x0040
    UINT32 CWDR;        // 0x0044
    UINT32 CDHIPR;      // 0x0048
    UINT32 CDCR;        // 0x004C
    UINT32 CTOR;        // 0x0050
    UINT32 CLPCR;       // 0x0054
    UINT32 CISR;        // 0x0058
    UINT32 CIMR;        // 0x005C
    UINT32 CCOSR;       // 0x0060
    UINT32 CGPR;        // 0x0064
    UINT32 CCGR[CCM_NUM_CCGR]; // 0x0068..0x0080
    UINT32 CMEOR;       // 0x0084
} CSP_CCM_REGS, *PCSP_CCM_REGS;

//------------------------------------------------------------------------------
// REGISTER OFFSETS
//------------------------------------------------------------------------------
#define CCM_CCR_OFFSET      0x0000
#define CCM_CCDR_OFFSET     0x0004
#define CCM_CSR_OFFSET      0x0008
#define CCM_CCSR_OFFSET     0x000C
#define CCM_CACRR_OFFSET    0x0010
#define CCM_CBCDR_OFFSET    0x0014
#define CCM_CBCMR_OFFSET    0x0018
#define CCM_CSCMR1_OFFSET   0x001C
#define CCM_CSCMR2_OFFSET   0x0020
#define CCM_CSCDR1_OFFSET   0x0024
#define CCM_CS1CDR_OFFSET   0x0028
#define CCM_CS2CDR_OFFSET   0x002C
#define CCM_CDCDR_OFFSET    0x0030
#define CCM_CHSCCDR_OFFSET  0x0034
#define CCM_CSCDR2_OFFSET   0x0038
#define CCM_CSCDR3_OFFSET   0x003C
#define CCM_CSCDR4_OFFSET   0x0040
#define CCM_CR2_OFFSET      0x0044
#define CCM_CDHIPR_OFFSET   0x0048
#define CCM_CDCR_OFFSET     0x004C
